notes/org/haskell.org
#+TITLE: Haskell
#+SETUPFILE: ../setup.org

* Installation

  Use [[https://www.haskell.org/ghcup/][ghcup]]. I tried using brew, but it seems that "brew install
  haskell-language-server" does not install the haskell-language-server-wrapper.

  #+begin_src sh
    curl --proto '=https' --tlsv1.2 -sSf \
         https://get-ghcup.haskell.org \
        | sh
  #+end_src

* New Project

** stack

  #+header: :var name="my-stack-project"
  #+header: :dir ~/Projects/codenotes/haskell
  #+begin_src sh
    stack new $name
  #+end_src

** cabal

   A minimal cabal project is much more simple than a stack project.

   #+header: :var name="algorithms"
   #+header: :dir ~/Projects/codenotes/haskell
   #+begin_src sh :results output
     mkdir $name && cd $name
     cabal init \
           --minimal \
           --simple \
           --license=NONE \
           --synopsis "Test project" \
           --package-name $name

     rm CHANGELOG.md
     sed -i "" '/^extra-source-files/d' $name.cabal
   #+end_src

   Generates a project like this:

   #+header: :dir ~/Projects/codenotes/haskell/myfirstapp
   #+begin_src sh :results output
     tree -F
   #+end_src

   : .
   : ├── app
   : │   └── Main.hs
   : ├── mylib.cabal
   : └── src
   :     └── MyLib.hs
   :
   : 2 directories, 3 files

   Emacs note: projectile doesn't detect =.cabal= files by default. I added that
   ability in my Emacs config (e.g. [[https://github.com/cfclrk/dotfiles/blob/2522f4eb6b6a048bcf80645adce202d4883912a2/emacs/cfclrk/init.el#L851-L856][here]]).
