docs/notes/haskell.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Haskell</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Haskell</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3226e47">Installation</a></li>
<li><a href="#org933456f">New Project</a>
<ul>
<li><a href="#org1c27f78">stack</a></li>
<li><a href="#org62f8b5f">cabal</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org3226e47" class="outline-2">
<h2 id="org3226e47"><a href="#org3226e47">Installation</a></h2>
<div class="outline-text-2" id="text-org3226e47">
<p>
Use <a href="https://www.haskell.org/ghcup/">ghcup</a>. I tried using brew, but it seems that "brew install
haskell-language-server" does not install the haskell-language-server-wrapper.
</p>

<div class="org-src-container">
<pre class="src src-sh">curl --proto <span style="color: #98be65;">'=https'</span> --tlsv1.2 -sSf <span style="color: #98be65;">\</span>
     https://get-ghcup.haskell.org <span style="color: #98be65;">\</span>
    | sh
</pre>
</div>
</div>
</div>

<div id="outline-container-org933456f" class="outline-2">
<h2 id="org933456f"><a href="#org933456f">New Project</a></h2>
<div class="outline-text-2" id="text-org933456f">
</div>
<div id="outline-container-org1c27f78" class="outline-3">
<h3 id="org1c27f78"><a href="#org1c27f78">stack</a></h3>
<div class="outline-text-3" id="text-org1c27f78">
<div class="org-src-container">
<pre class="src src-sh">stack new $<span style="color: #dcaeea;">name</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org62f8b5f" class="outline-3">
<h3 id="org62f8b5f"><a href="#org62f8b5f">cabal</a></h3>
<div class="outline-text-3" id="text-org62f8b5f">
<p>
A minimal cabal project is much more simple than a stack project.
</p>

<div class="org-src-container">
<pre class="src src-sh">mkdir $<span style="color: #dcaeea;">name</span> &amp;&amp; <span style="color: #c678dd;">cd</span> $<span style="color: #dcaeea;">name</span>
cabal init <span style="color: #98be65;">\</span>
      --minimal <span style="color: #98be65;">\</span>
      --simple <span style="color: #98be65;">\</span>
      --license=NONE <span style="color: #98be65;">\</span>
      --synopsis <span style="color: #98be65;">"Test project"</span> <span style="color: #98be65;">\</span>
      --package-name $<span style="color: #dcaeea;">name</span>

rm CHANGELOG.md
sed -i <span style="color: #98be65;">""</span> <span style="color: #98be65;">'/^extra-source-files/d'</span> $<span style="color: #dcaeea;">name</span>.cabal
</pre>
</div>

<p>
Generates a project like this:
</p>

<div class="org-src-container">
<pre class="src src-sh">tree -F
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
.
├── app
│   └── Main.hs
├── mylib.cabal
└── src
    └── MyLib.hs

2 directories, 3 files
</pre>


<p>
Emacs note: projectile doesn't detect <code>.cabal</code> files by default. I added that
ability in my Emacs config (e.g. <a href="https://github.com/cfclrk/dotfiles/blob/2522f4eb6b6a048bcf80645adce202d4883912a2/emacs/cfclrk/init.el#L851-L856">here</a>).
</p>
</div>
</div>
</div>
</div>
</body>
</html>
